PontusO/iLabs_AT_Hearth/sdkconfig.defaults.esp32c6
# iLabs AT Matter - ESP32-C6 target.
#
# B2 keeps the console (and CHIP shell) on the default UART0 pins (GPIO16/17),
# which is where the RP2350 host bridge is wired - so Matter bring-up logs and
# `matter device factoryreset` are reachable exactly like the stock esp-matter
# light. When the AT+MT interface is wired in (B4), the console moves off to
# GPIO2 and the AT link takes UART1 on GPIO16/17 (as in the ESP-NOW firmware).
CONFIG_IDF_TARGET="esp32c6"
